lvips/p4c5-agent-terminal/hardware/p4c5-agent-terminal/sdkconfig.defaults
# p4c5-agent-terminal sdkconfig defaults
# 生成于 M4 阶段 — 最小可编译骨架

# ── 目标芯片 ──
CONFIG_IDF_TARGET="esp32p4"

# ── 分区表 ──
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# ── Flash (16MB) ──
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ── PSRAM (Octal, 默认 P4 配置) ──
CONFIG_ESP_PSRAM=y
CONFIG_SPIRAM=y

# ── WiFi (暂时禁用，M5 只需验证启动）──
# CONFIG_ESP_HOSTED_ENABLED=y
# CONFIG_ESP_HOSTED_CP_TARGET_ESP32C5=y
# CONFIG_SLAVE_IDF_TARGET_ESP32C5=y

# ── 音频 ──
# 采样率 24kHz（ES8311 + ES7210 推荐）
# 具体采样率由组件代码设定，此处仅做占位

# ── FreeRTOS ──
CONFIG_FREERTOS_HZ=1000

# ── 日志级别 ──
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# ── 4G 模组 ──
# CONFIG_P4C5_4G_ENABLED 由 Kconfig.projbuild 定义

# ── LWIP ──
CONFIG_LWIP_MAX_SOCKETS=16

# ── ESP32-P4 chip revision（v1.3 是 rev_less_v3）──
# 🔴 CRITICAL: v1.x and v3.x are mutually exclusive!
# v1.3 chip needs SELECTS_REV_LESS_V3=y, otherwise bootloader panics with IllegalInstruction
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# ── DSH Client ──
CONFIG_P4C5_DSH_WEBSOCKET_URL="ws://dsh.example.com/ws"
CONFIG_P4C5_DSH_DEVICE_ID="p4c5-001"
CONFIG_P4C5_DSH_AUTH_TOKEN=""

# ── LVGL (T14) ──
# 颜色深度 16 = RGB565（与 ST7102 RGB565 匹配）
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH=16
CONFIG_LV_COLOR_DEPTH_16=y
# 内置堆：lv_timer_handler + 小对象分配；设 256KB 留足够余量
CONFIG_LV_MEM_SIZE="(256*1024)"
# LV_DRAW_SW：启用 RGB565 软渲染
CONFIG_LV_USE_DRAW_SW=y
CONFIG_LV_DRAW_SW_SUPPORT_RGB565=y
# DPI 刷新周期 ~33ms = 30fps
CONFIG_LV_DEF_REFR_PERIOD=33
# 字体：默认 14，额外启用 24 供按钮使用
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_24=y

